Overload List
Name  |   Description
IsValidType(ElementId)
 Checks if given type is valid for this element.
IsValidType(Document, ICollection ElementId , ElementId)
 Checks if given type is valid for the set of elements.
 See Also
  Element Class
  Element Members
  Autodesk.Revit.DB Namespace